<?php

return [
    "group" => [
        "create" => [
            "success" => "Новая группа успешно создана",
            "notFoundAlg" => "Такого алгоритма не существует",
            "error" =>  "Не удалось создать новую группу"
        ],
        "status" => [
            "success" => "Статус группы задач успешно получен",
            "notFound" => "Такой группы задач не существует",
            "error" =>  "Не удалось получить статус группы задач"
        ],
        "stop" => [
            "success" => "Выполнение группы задач успешно остановлено",
            "error" =>  "Не удалось остановить выполнение группы задач"
        ],
    ],
    "task" => [
        "get" => [
            "success" => "Список задач успешно получен",
            "error" =>  "Не удалось получить список задач"
        ],
        "create" => [
            "success" => "Новая задача успешно добавлена",
            "error" =>  "Не удалось создать новую задачу"
        ],
        "status" => [
            "success" => "Статус задачи успешно получен",
            "notFound" => "Такой задачи не существует",
            "error" =>  "Не удалось получить статус задачи"
        ],
        "stop" => [
            "success" => "Выполнение задачи успешно остановлено",
            "error" =>  "Не удалось остановить выполнение задачи"
        ],
    ],
];
